# National Parks Endangered Species Data Analysis Project

## Project Scoping

Goal: draw some conclusions about endangered species in national parks

### Steps:
1. load and examine data
2. EDA and data cleaning
3. combine data
4. visualize data
5. draw conclusions

In [4]:
#load packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Step 1: load and examine data

In [52]:
#load data
df_spec = pd.read_csv('species_info.csv')
df_obs = pd.read_csv('observations.csv')

In [54]:
df_spec.head()

,category,scientific_name,common_names,conservation_status
0,Mammal,Clethrionomys gapperi gapperi,Gapper's Red-Backed Vole,NaN
1,Mammal,Bos bison,"American Bison, Bison",NaN
2,Mammal,Bos taurus,"Aurochs, Aurochs, Domestic Cattle (Feral), Dom...",NaN
3,Mammal,Ovis aries,"Domestic Sheep, Mouflon, Red Sheep, Sheep (Feral)",NaN
4,Mammal,Cervus elaphus,Wapiti Or Elk,NaN

In [56]:
df_obs.head()

            scientific_name                            park_name  observations
0        Vicia benghalensis  Great Smoky Mountains National Park            68
1            Neovison vison  Great Smoky Mountains National Park            77
2         Prunus subcordata               Yosemite National Park           138
3      Abutilon theophrasti                  Bryce National Park            84
4  Githopsis specularioides  Great Smoky Mountains National Park            85

### Step 2: EDA and data cleaning

In [58]:
df_spec.describe(include='all')

,category,scientific_name,common_names,conservation_status
count,5824,5824,5824,191
unique,7,5541,5504,4
top,Vascular Plant,Castor canadensis,Brachythecium Moss,Species of Concern
freq,4470,3,7,161

In [60]:
df_spec.conservation_status.unique()

array([nan, 'Species of Concern', 'Endangered', 'Threatened',
       'In Recovery'], dtype=object)

In [62]:
df_spec.category.unique()

array(['Mammal', 'Bird', 'Reptile', 'Amphibian', 'Fish', 'Vascular Plant',
       'Nonvascular Plant'], dtype=object)

In [64]:
df_spec.isna().sum()

category                  0
scientific_name           0
common_names              0
conservation_status    5633
dtype: int64

Because there are so many NaNs in the conservation_status column, and because there is no conservation status label for species that are not a concern, I will assume that missing information means the species is not a concern.

In [66]:
df_spec.loc[:, 'conservation_status'] = df_spec.loc[:, 'conservation_status'].fillna('Not a Concern')
df_spec.isna().sum()

category               0
scientific_name        0
common_names           0
conservation_status    0
dtype: int64

In [27]:
df_obs.describe(include='all')

         scientific_name                            park_name  observations
count              23296                                23296  23296.000000
unique              5541                                    4           NaN
top     Myotis lucifugus  Great Smoky Mountains National Park           NaN
freq                  12                                 5824           NaN
mean                 NaN                                  NaN    142.287904
std                  NaN                                  NaN     69.890532
min                  NaN                                  NaN      9.000000
25%                  NaN                                  NaN     86.000000
50%                  NaN                                  NaN    124.000000
75%                  NaN                                  NaN    195.000000
max                  NaN                                  NaN    321.000000

In [33]:
df_obs.park_name.unique()

array(['Great Smoky Mountains National Park', 'Yosemite National Park',
       'Bryce National Park', 'Yellowstone National Park'], dtype=object)

### Step 3: combine data

### Step 4: visualize data

### Step 5: draw conclusions